updating README with notes and acknowledgements
